<!doctype html>
<html class="no-js" lang="ja">
	<head>
	<meta charset="utf-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
	<meta name="viewport" content="width=device-width">
	<meta name="description" content="All doggs wanna be a Geek">
	<meta property="og:locale" content="ja_JP">
	<meta property="og:title" content="多言語サイトを作る際のフロント側での注意点 | jekylog">
	<meta property="og:type" content="website">
	<meta property="og:url" content="http://fingaholic.github.com/posts/2012-05-10-language.html">
	<meta property="og:image" content="http://fingaholic.github.com/img/logo1.png">
	<meta property="og:site_name" content="jekylog">
	<meta property="og:description" content="英語、ベトナム語でコーディングする案件をやっているので諸々の手順を記しておく。">
	<meta property="fb:app_id" content="414280305262678">
	<title>多言語サイトを作る際のフロント側での注意点 | jekylog</title>
	<link rel="shortcut icon" href="/img/favicon.ico" type="image/x-icon">
	<link rel="alternate" href="/atom.xml" type="application/rss+xml" title="jekylog">
	<link rel="stylesheet" href="/css/all.min.css">
	<script src="/js/modernizr-2.5.3.min.js"></script>
	<script>if(!Modernizr.mq('only all')) Modernizr.load('/js/respond.min.js');</script>
	<script src="//typesquare.com/accessor/script/typesquare.js?4K0leOFaobI%3D"></script>
	<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js"></script>
	<script src="/js/all.min.js"></script>
</head>

	<body>
		<div class="area-body">
			<header class="area-header">
	<div class="mod-header">
		<hgroup>
			<h1><a href="/">jekylog</a></h1>
			<h2>All doggs wanna be a Geek</h2>
		</hgroup>
	</div>
	<div class="mod-gnavi">
		<nav>
			<ul>
				<li><a href="/">Home</a></li>
				<li><a href="/archive.html">Archive</a></li>
				<li><a href="/about.html">About</a></li>
			</ul>
		</nav>
	</div>
</header>

			<div class="area-main"><article class="mod-postdetail">
	<header>
		<p><time datatime="10 May 2012">10 May 2012</time></p>
		<h1>多言語サイトを作る際のフロント側での注意点</h1>
	</header>
	<section class="mod-postmain"><h1 id='id27'>使用する言語の言語コードを明示する</h1>

<p>HTML5、XHTMLに関わらず大体普段使用しているhtmlタグのlang属性は「ja」だと思う。まずはコレを使用する言語コードにする。英語なら「en」、ベトナム語なら「vi」。大体下記サイトに載ってると思う。</p>

<p><a href='http://www.cybergarden.net/references/langcode/' title='言語コード一覧 | references | CYBER&amp;#64;GARDEN'>言語コード一覧 | references | CYBER&#64;GARDEN</a></p>

<h1 id='utf8'>文字コードは「utf-8」に</h1>

<p>色々あるけど「utf-8」がデファクトスタンダードだと思う。</p>

<h1 id='id28'>エディタの言語設定を変更する</h1>

<p>使っているエディタによると思うけどこれも大体みんな日本語か英語だと思う。ただこのままだと中国語だったり韓国語だったりの2バイト言語（日本語もそうだけど）はコピペが出来ないのでエディタでこの辺りの設定を変えなきゃだめっぽい。ただVimでの変更方法が分からないのでちょっと保留。とりあえずDreamweaverではそのままコピペ出来た。</p>

<p>ちなみに数値文字参照とか使えば言語の設定に関わらず表示は担保されるけど下記みたく日本語サイトの中のコンテンツとして他言語の文章を掲載するケース以外だとあんまり現実的じゃない。運用するのは現地の人だろうし何より手間がかかるし。とりあえずモックとかで確認出ししなきゃダメな時とかには数値文字参照でもいいかと。</p>
<dl>
<dt>ベトナム語</dt>
<dd class='snp-font-multilingual' lang='vi'>SGTT.VN - Th&#225;ng 7.2011, c&#243; ba tr&#7867; em &#7903; D&#259;k L&#259;k v&#236; &#259;n qu&#7843; r&#7915;ng m&#224; t&#7917; vong. B&#225;o ch&#237; c&#361;ng t&#7915;ng th&#244;ng tin c&#243; du kh&#225;ch l&#234;n n&#250;i kh&#225;m ph&#225; r&#7915;ng nguy&#234;n sinh &#273;&#227; th&#7917; nh&#7845;m nh&#225;p tr&#225;i m&#227; ti&#7873;n v&#236; ng&#7905; l&#224; cam r&#7915;ng d&#7851;n &#273;&#7871;n ng&#7897; &#273;&#7897;c su&#253;t ch&#7871;t.</dd>
<dt>タミル語</dt>
<dd class='snp-font-multilingual' lang='ta-IN'>&#2986;&#3009;&#2980;&#3009;&#2975;&#3007;&#2994;&#3021;&#2994;&#3007; : &#2972;&#2985;&#2997;&#2992;&#3007; &#2990;&#3009;&#2980;&#2994;&#3021; &#2990;&#3006;&#2992;&#3021;&#2970;&#3021; &#2990;&#3006;&#2980;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2991; &#2951;&#2984;&#3021;&#2980;&#3007;&#2991;&#3006;&#2997;&#3007;&#2994;&#3021; &#2980;&#3015;&#2991;&#3007;&#2994;&#3016; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007; 13 &#2970;&#2980;&#2997;&#3008;&#2980;&#2990;&#3021; &#2970;&#2992;&#3007;&#2997;&#2975;&#3016;&#2984;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2953;&#2994;&#2965;&#2995;&#2997;&#3007;&#2994;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2986;&#2992;&#3009;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#3006;&#2985;&#2990;&#3021; &#2975;&#3008;. &#2953;&#2994;&#2965;&#3007;&#2994;&#3021; &#2949;&#2980;&#3007;&#2965; &#2980;&#3015;&#2991;&#3007;&#2994;&#3016; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2984;&#3006;&#2975;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980;&#3007;&#2991;&#3006; &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021; &#2951;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2972;&#2985;&#2997;&#2992;&#3007; &#2990;&#3006;&#2980;&#2990;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; &#2990;&#3006;&#2992;&#3021;&#2970;&#3021; &#2990;&#3006;&#2980;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2991; &#2980;&#3015;&#2991;&#3007;&#2994;&#3016; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2965;&#3021;&#2965;&#3006;&#2985; &#2949;&#2995;&#2997;&#3008;&#2975;&#3021;&#2975;&#3016; &#2980;&#3015;&#2991;&#3007;&#2994;&#3016; &#2950;&#2979;&#3016;&#2991;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2949;&#2980;&#2985;&#3021;&#2986;&#2975;&#3007; &#2972;&#2985;&#2997;&#2992;&#3007; &#2990;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 18.69 &#2990;&#3007;&#2994;&#3021;&#2994;&#3007;&#2991;&#2985;&#3021; &#2965;&#3007;&#2994;&#3019;&#2997;&#3009;&#2990;&#3021;, &#2986;&#3007;&#2986;&#3021;&#2992;&#2997;&#2992;&#3007; &#2990;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 16&#2990;&#3007;&#2994;&#3021;&#2994;&#3007;&#2991;&#2985;&#3021; &#2965;&#3007;&#2994;&#3019;&#2997;&#3009;&#2990;&#3021;, &#2990;&#3006;&#2992;&#3021;&#2970;&#3021; &#2990;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 47.60 &#2990;&#3007;&#2994;&#3021;&#2994;&#3007;&#2991;&#2985;&#3021; &#2965;&#3007;&#2994;&#3019;&#2997;&#3009;&#2990;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#2975;&#2984;&#3021;&#2980; 3 &#2990;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980;&#3007;&#2991;&#3006;&#2997;&#3007;&#2994;&#3021; &#2990;&#3018;&#2980;&#3021;&#2980;&#2990;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#3015;&#2991;&#3007;&#2994;&#3016; 82.29 &#2990;&#3007;&#2994;&#3021;&#2994;&#3007;&#2991;&#2985;&#3021; &#2965;&#3007;&#2994;&#3019;&#2997;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2965;&#2975;&#2984;&#3021;&#2980; &#2950;&#2979;&#3021;&#2975;&#3019;&#2975;&#3009; &#2962;&#2986;&#3021;&#2986;&#3007;&#2975;&#3009;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2980;&#3009; 13 &#2970;&#2980;&#2997;&#3008;&#2980;&#2990;&#3021; &#2970;&#2992;&#3007;&#2997;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2965;&#2975;&#2984;&#3021;&#2980; &#2950;&#2979;&#3021;&#2975;&#3009; &#2951;&#2980;&#3015; &#2965;&#3006;&#2994;&#2965;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 94.39 &#2990;&#3007;&#2994;&#3021;&#2994;&#3007;&#2991;&#2985;&#3021; &#2965;&#3007;&#2994;&#3019; &#2980;&#3015;&#2991;&#3007;&#2994;&#3016; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;.</dd>
</dl>
<h1 id='fontfamily'>「font-family」の設定</h1>

<p>これも適切に設定してやらないとIEで文字化けする。今回ベトナム語がネックなので調べてると下記ページに載ってた。これも調べるともっと色んなフォントがありそうな気もするけど無難なのが一番良さ気。</p>

<p><a href='http://yama-masa.com/wp/archives/6' title='ベトナム語用フォント | phew! phew! phew!'>ベトナム語用フォント | phew! phew! phew!</a></p>

<p>Wordpressとかだと多言語サイト用のプラグインとかあるっぽいけどバックグラウンドに強い人が居るのは必須だと思う。</p></section>
</article>
<div class="mod-socialbutton">
	<div class="tw-like"><a href="https://twitter.com/share" class="twitter-share-button" data-via="FiNGAHOLiC" data-lang="ja">ツイート</a></div>
	<div class="fb-like" data-send="false" data-layout="button_count" data-show-faces="false" data-font="verdana"></div>
</div>


	<div class="mod-pagenation">
		
			<div class="prev"><a href="/posts/2012-05-02-grunt.html">&#171; Previous Entry</a></div>
		
		
			<div class="next"><a href="/posts/2012-05-11-develop.html">Next Entry &#187;</a></div>
		
	</div>

</div>
			<footer class="area-footer">
	<div class="mod-footer">
		<p><small>Copyright &#xA9; 2012 fingaholic</small></p>
	</div>
</footer>

		</div>
		<script type="text/javascript">
	var _gaq = _gaq || [['_setAccount', 'UA-30944384-1'], ['_trackPageview']];
	(function(d, t){
		var g = d.createElement(t), s = d.getElementsByTagName(t)[0];
		g.async = true;
		g.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
		s.parentNode.insertBefore(g, s);
	})(document, 'script');
</script>


		<div id="fb-root"></div>
		<div class="mod-github"><a href="http://github.com/fingaholic"><img src="https://a248.e.akamai.net/camo.github.com/5d21241b64dc708fcbb701f68f72f41e9f1fadd6/687474703a2f2f73332e616d617a6f6e6177732e636f6d2f6769746875622f726962626f6e732f666f726b6d655f6c6566745f7265645f6161303030302e706e67" alt="Fork me on GitHub"></a></div>
	</body>
</html>
